//#region []

/* --Folder&fills to app--
  --assets
  --layouts
  middleware
  --pages
  --plugins
  --public
  --stores
  --.gitignore
  .npmrc
  --README.md
  --app.vue
  --nuxt.config.ts
  --package.json
  --tailwind.config.js
  --ts
  config.json
  --ZZ-deleted.ts
*/

//#endregion

// [ ] فيديو شرح لعمل سيرفر ExpressTypeScript ==> https://www.youtube.com/watch?v=N17Tef8gh-Q&ab_channel=YoussefAbbas
// [ ]  
// {{www}}/api/posts
//#region [use in app [plugins,framework]]
/* --plugins&framework to app--
  [x] npm init -y                             |
  [x] npm i express dotenv                          |
  [x] npm i -D nodemon ts-node @types/node typescript @types/express
  [x] tsc --init

  [ ] i18n                          | yarn add ???????????????                |
  [ ] vue-sweetalert2               | yarn add vue-sweetalert2                | https://sweetalert2.github.io/#download
  [ ] toastification@next           | yarn add vue-toastification@next        | https://vue-toastification.maronato.dev
  [ ] animate.css                   | yarn add animate.css                    | https://animate.style/                                                  | use nuxt.config.js -> css: ['animate.css/animate.min.css'] | مكتبة انميشاً وتحريكات جاهذة
  [ ] nuxt-icon                     | yarn add --dev nuxt-icon                | https://icones.js.org/
  [ ] nuxt-lodash                   | yarn add --dev nuxt-lodash              | https://www.youtube.com/watch?v=MeiOH8gMvns&ab_channel=AlgorithmAcademy | هذه المكتبة تحتوي علي دوال جافا سهلة الاستخدام
  [ ]
*/
//#endregion

//#region [ قائمة المهام ايومية ]
/* ----
[ ] ضبط وإنهاء مشاكل الرسائل
[ ] ضبط وإنهاء مشاكل الاشعارات
[ ] ضبت إتجاه الرسائل مع اللغة و الدارك مود

[ ] تظيف المشرو وضبت الفيلات
[ ] عمل مشر,ع السيرة الاتية
[ ] ضبط شكل الجيت هب
[ ]
[ ]

  
--- شرح نظام الحماية والامان :-
--- 01) شرح تسجيل الدخول :-
    [ ] Auth with local          => https://www.youtube.com/watch?v=gBYKdna-P5Y&list=PLA2Wns-dg9lcTebKV8w4LF0lqOPJpud4N&index=8&ab_channel=AliSleem%7C%D8%B9%D9%84%D9%8A%D8%B3%D9%84%D9%8A%D9%85
    [ ] Auth with google         => https://www.youtube.com/watch?v=gBYKdna-P5Y&list=PLA2Wns-dg9lcTebKV8w4LF0lqOPJpud4N&index=8&ab_channel=AliSleem%7C%D8%B9%D9%84%D9%8A%D8%B3%D9%84%D9%8A%D9%85
*/
//#endregion



// Error ----- ----- ----- ----- ----- ----- ----- ----- ----- ----- ----- ----- ----- ----- ----- ----- -----
// [+]=> تشير إلي تم الحل بشكل نهائي
// [x] => تشير إلي تم الحل بشكل ماقت

// [ ] مشكلة تحويل اللغات
// [ ] مشطلة الريست في الاستوري
// [ ]







//#region [ تقديم عروض ]
/*  قائمة المشاريع

مشاريع شركات:-
---- ---- ----
[ ] شركة استشارية - Consulting company    |    [frontEnd]
    https://mostaql.com/project/859810-%D8%AA%D8%B5%D9%85%D9%8A%D9%85-%D8%B5%D9%81%D8%AD%D8%A7%D8%AA-%D9%85%D9%88%D9%82%D8%B9-%D8%A5%D9%84%D9%83%D8%AA%D8%B1%D9%88%D9%86%D9%8A
*/
/*
* اسمى حسين عبدالشافي - أعمل ك Front-End Development *
  قمت بالعديد من الاعمال والمشاريع ولدى الخبرة الكافية فى هذا المجال.
--- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- ---

أهلا بك في خدمة تصميم صفحات الويب المتوافقة مع جميع الاجهزة:

  - اقوم إنشاءوتصميم صفحة هبوط متجاوبة مع جميع الشاشات الكبيرة والصغيرة فسأقوم بتنفيذ ذالك لك بإحترافية.
  - اذا كنت تريد بناء صحفة هبوط لبيع منتجك او لعرض خدماتك او لتكون موقع شخصي لعرض بخبراتك في المجال الخاص بك.
  - إذا كنت تريد إنشاء صفحة ويب احترافية متوافقة مع جميع الاجهزة,من الموبايلات بجميع احجامها الي الشاشات بجميع احجامها.
  - اللغات المستخدمة في الخدمة HTML, CSS, JavaScript

--- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- ---

* مميزات العمل معا :

  - بفضل الله عملي متقن ووجود اعمال سابقة تشهد على ذالك👌.
  - أكواد مرتبة ونظيفة موافقة للمعايير لصداقة محركات البحث .
  - الاهتمام بأدق التفاصيل وأصغرها لإخراج العمل بأفضل شكل إحترافى .
  - والتنفيذ في اسرع وقت والتسليم في الوقت المحدد.
  - دعم تقني للموقع بعد الانشاء مجاني.
  - لن اتركك حتي تكون راضي تماما عن الخدمة المقدمة.
  - لك الحرية في طلب التعديلات بعدد لانهائي حتي الرضا تمام عن الخدمة❤️.


--- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- ---
            شعارنا الدائم </ إرضاء الزبون غايتنا >
--- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- ---



تطويرات متوفرة لهذه الخدمة :-

إنشاء صفحة اضافية - مقابل 25.00$ إضافية على سعر الخدمة. سيزيد مدة التنفيذ يوم إضافي.

إنشاء صفحة اضافية - مقابل 30.00$ إضافية على سعر الخدمة. سيزيد مدة التنفيذ يومين إضافيين.

إنشاء أربع صفح أضافية - مقابل 100.00$ إضافية على سعر الخدمة. سيزيد مدة التنفيذ يوم إضافي.



اضافة قسم جديد - مقابل 10.00$ إضافية على سعر الخدمة. سيزيد مدة التنفيذ يومين إضافيين.

اضافتين قسمين - مقابل 20.00$ إضافية على سعر الخدمة. سيزيد مدة التنفيذ يوم إضافي.

إنشاء صفحة اضافية - مقابل 30.00$ إضافية على سعر الخدمة. سيزيد مدة التنفيذ يوم إضافي.

إنشاء 3 صفحات اضافية - مقابل 75.00$ إضافية على سعر الخدمة. سيزيد مدة التنفيذ 3 أيام إضافية.
*/
//#endregion

// @desc   Create ....
// @route  get /hi
// @access public

// @desc   listen app
// @access Private